florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- Mode state tracking ----
static uint8_t  currentModeFlags  = 0;       // Current mode flags (bit 0=4x4, bit 1=tank)

// ---- Power/Audio state tracking ----
static bool     welcomePlayed     = false;
static bool     farewellPlayed    = false;
static uint8_t  lastAppliedAudioVolume = 15;
static unsigned long lastRemoteVolumeSetMs = 0;
static constexpr unsigned long REMOTE_VOLUME_DEBOUNCE_MS = 250;
static constexpr uint8_t       REMOTE_VOLUME_HYSTERESIS  = 2;
// Brownout/reboot guard: minimum interval between WELCOME sounds.
// On rapid MCU resets (brownout, watchdog) the ESP32 may restart
// multiple times in quick succession.  This timestamp prevents audio
// spam by enforcing a cooldown.  NOTE: static RAM is NOT guaranteed
// to persist across all reset types on all ESP32 variants.  On a
// full power cycle, lastWelcomePlayMs reinitialises to 0 (desired:
// fresh boot always plays welcome).  On brownout or SW reset, the
// per-sound cooldown in audio_manager.cpp (SOUND_COOLDOWN_MS=4s)
// provides a secondary safety net even if this variable is lost.
static unsigned long lastWelcomePlayMs = 0;
static constexpr unsigned long WELCOME_COOLDOWN_MS = 5000;  // 5 s minimum gap

// ---- Runtime overlay state ----
static bool     showOverlay       = true;    // overlay visible on initial screen only
static uint32_t lastFrameStart    = 0;

// ---- Audio event tracking ----
static uint8_t  lastAudioSystemState = 0;     // detect state transitions for error alert
static bool     batteryLowPlayed  = false;     // one-shot for battery warning
static bool     batteryCritPlayed = false;     // one-shot for battery critical
static constexpr uint16_t BATTERY_LOW_THRESHOLD_RAW = 2000;  // 20.00 V in 0.01 V units
static constexpr uint16_t BATTERY_CRIT_THRESHOLD_RAW = 1800; // 18.00 V in 0.01 V units
static unsigned long lastObstacleWarnMs = 0;   // debounce obstacle warning beeps
static constexpr unsigned long OBSTACLE_WARN_INTERVAL_MS = 2000;

// ---- Runtime counter for maintenance tracking ----
static unsigned long lastRuntimeTickMs = 0;
static uint32_t      runtimeAccumMs    = 0;       // partial seconds accumulated in RAM (§2.2)
static constexpr unsigned long RUNTIME_COMMIT_INTERVAL_MS = 60000;  // commit to NVS every 60 s
static bool     maintenanceWarnPlayed = false;

// ---- Temperature audio tracking ----
static bool     tempHighPlayed = false;        // one-shot for temp high warning
static constexpr int8_t TEMP_HIGH_THRESHOLD = 85;  // °C — play alert above this
static constexpr int8_t TEMP_HIGH_HYSTERESIS = 5;  // °C — hysteresis to prevent oscillation

// ---- ABS/TCS audio tracking ----
static uint8_t  lastAbsActive = 0;
static uint8_t  lastTcsActive = 0;

// ---- Overcurrent audio tracking ----
static uint8_t  lastSafetyError = 0;           // last SafetyError code for transition detect

// ---- Lights audio tracking ----
static bool     lastFrontRelayOn  = false;
static bool     lastRearRelayOn   = false;
static bool     lightsAudioInit   = false;     // skip first transition on startup

// ---- Multi-error burst arbitration ----
// When >1 error/warning fires within the burst window, play the highest-severity
// sound instead of collapsing to ERROR_GENERAL (Phase 1 AUDIO_MITIGATION_PLAN).
// Severity order: EMERGENCY > OVERCURRENT > BATTERY_CRITICAL > SENSOR errors > ERROR_GENERAL
static uint8_t  errorBurstCount = 0;
static unsigned long errorBurstStartMs = 0;
static constexpr unsigned long ERROR_BURST_WINDOW_MS = 2000;  // 2 s window
static constexpr uint8_t ERROR_BURST_THRESHOLD = 2;           // >=2 errors = burst
static audio::Sound    burstDominantSound = audio::Sound::ERROR_GENERAL;
static audio::Priority burstDominantPri   = audio::Priority::HI;

/// Burst severity ranking — higher value = more important for the driver.
/// Determines which sound wins when multiple errors fire within the burst window.
static uint8_t burstSeverity(audio::Sound s) {
    switch (s) {
        case audio::Sound::EMERGENCY:            return 6;
        case audio::Sound::OVERCURRENT:          return 5;
        case audio::Sound::BATTERY_CRITICAL:     return 4;
        case audio::Sound::SENSOR_TEMP_ERROR:    return 3;
        case audio::Sound::SENSOR_CURRENT_ERROR: return 3;
        case audio::Sound::SENSOR_SPEED_ERROR:   return 3;
        case audio::Sound::ENCODER_ERROR:        return 3;
        case audio::Sound::TEMP_HIGH:            return 3;
        case audio::Sound::BATTERY_LOW:          return 2;
        case audio::Sound::OBSTACLE_WARN:        return 2;
        case audio::Sound::ERROR_GENERAL:        return 1;
        default:                                 return 0;
    }
}

// ---- LED brake/reverse detection thresholds ----
// Speed sum threshold: 4 wheels × 0.5 km/h × 10 (0.1 km/h units) = 20
static constexpr uint32_t LED_SPEED_SUM_THRESHOLD = 20;
// Traction average below which we consider braking (0–100% scale)
static constexpr uint8_t LED_TRACTION_BRAKING_THRESHOLD = 5;
// Traction average below which we consider regen deceleration (above braking).
// Range: braking < trAvg ≤ regen threshold, with speed > 0.
// This triggers the blue-pulse regen indicator on the rear centre zone.
static constexpr uint8_t LED_TRACTION_REGEN_THRESHOLD = 20;

// ---- NVS flush interval ----
static unsigned long lastNvsFlushMs = 0;
static constexpr unsigned long NVS_FLUSH_INTERVAL_MS = 10000;  // 10 seconds

// ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
// Detect whether the STM32 alive counter (heartbeat byte 0) is actually
// incrementing.  A frozen STM32 (IWDG not kicking, or timer firing without
// the main loop running) would keep sending the same counter value.
// After STM32_HB_FREEZE_COUNT consecutive identical counter values the ESP32
// considers the STM32 non-responsive and inhibits further motion commands.
static constexpr uint8_t  STM32_HB_FREEZE_COUNT = 5;   // 5 × HEARTBEAT_INTERVAL_MS (see STM32_HB_FREEZE_TIME_MS below)
// Tie the freeze-detection window to the heartbeat period at compile time so
// that changing one constant cannot silently desynchronise the other.
static constexpr uint32_t STM32_HB_FREEZE_TIME_MS =
    (uint32_t)STM32_HB_FREEZE_COUNT * can::HEARTBEAT_INTERVAL_MS;
static_assert(STM32_HB_FREEZE_TIME_MS < can::CAN_LOSS_TIMEOUT_MS,
              "STM32 freeze detection must trigger before CAN-loss timeout");
static uint8_t  stm32HbLastCounter   = 0xFFU;           // Init to impossible value
static uint8_t  stm32HbSameCount     = 0;
static bool     stm32IsAlive         = false;

