florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    for (;;) {
        // 1. Copy latest vehicle data from main loop
        if (xSemaphoreTake(vdMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            localVD = renderVD;
            xSemaphoreGive(vdMutex);
        }

        // First-boot wizard trigger (executed at most once per boot, on
        // the first iteration after the screen manager is alive).  The
        // engineering-menu "TOUCH CALIBRATION" entry is handled atomically
        // inside ScreenManager::update() (right after engineering exit)
        // so we don't need to poll for it here.
        if (firstBootCheckPending) {
            firstBootCheckPending = false;
            screenManager.requestTouchWizard(/*firstBoot=*/true);
        }

        // 2. Update & render screen (frame limiter inside screenManager)
        lastFrameStart = millis();
        screenManager.update(localVD);

        // 3. Runtime overlay on boot screen only
        {
            uint32_t frameTime = millis() - lastFrameStart;
            if (showOverlay && screenManager.isInitialScreen()) {
                draw_runtime_overlay(tft, frameTime);
            } else {
                showOverlay = false;
            }
        }

        // 4. Centralized touch handling (same SPI bus as TFT)
        {
            uint16_t tx = 0, ty = 0;
            bool isTouched = tft.getTouch(&tx, &ty);
            touch::update(isTouched, static_cast<int16_t>(tx),
                          static_cast<int16_t>(ty));

            touch::TouchEvent evt = touch::getEvent();

            if (evt.type == touch::EventType::LONG_PRESS) {
                // Block long-press while tank confirm modal is active (§3.1)
                if (!screenManager.isTankConfirmActive()) {
                    screenManager.onLongPress(evt.x, evt.y);
                }
            }

            if (evt.type == touch::EventType::CORNER_LONG_PRESS) {
                // Robust Engineering-access fallback (top-right / battery icon).
                // Works even in LIMP_HOME / CAN-LOST; gated to parked vehicle
                // inside the screen manager.  Suppressed during tank confirm.
                if (!screenManager.isTankConfirmActive()) {
                    screenManager.onCornerLongPress(evt.x, evt.y);
                }
            }

            if (evt.type == touch::EventType::TAP) {
                screenManager.onTouch(evt.x, evt.y);

                if (!screenManager.isBlockingInput()) {
                    // ---- Tank turn confirmation dialog active ----
                    // If the confirm bar is visible, route ALL taps to it first.
                    if (screenManager.isTankConfirmActive()) {
                        uint8_t confirmResult = screenManager.handleTankConfirmTouch(evt.x, evt.y);
                        if (confirmResult == 1) {
                            // User confirmed YES → queue the actual toggle
                            TouchAction act = TouchAction::TANK_MODE_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        // confirmResult 2 = NO (dismissed), 0 = consumed
                        // In all cases, skip normal touch handling this frame
                    } else {
                        // Normal touch handling (no confirm dialog)
                        if (ui::LedToggle::hitTestFront(evt.x, evt.y)) {
                            TouchAction act = TouchAction::FRONT_LED_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        if (ui::LedToggle::hitTestRear(evt.x, evt.y)) {
                            TouchAction act = TouchAction::REAR_LED_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        uint8_t modeHit = ui::ModeIcons::hitTest(evt.x, evt.y);
                        if (modeHit == 3) {
                            // Show confirmation dialog instead of immediate toggle
                            screenManager.showTankConfirm();
                        }
                    }
                }
            }

#if RUNTIME_MONITOR
            // Debug overlay (perf stats) — toggled explicitly from the
            // Engineering menu, NOT from the global long-press gesture.
            // Never paint it over a blocking screen (PIN / Engineering /
            // touch-cal) so it can't be superimposed on those menus.
            // Uses lastFrameStart (captured once per frame at line 367)
            // to comply with frame time contract — no direct millis() in UI.
            if (!screenManager.isBlockingInput()) {
                RTMON_OVERLAY_UPDATE(isTouched, lastFrameStart);
                RTMON_OVERLAY_DRAW(tft, lastFrameStart);
            }
#endif
        }

        vTaskDelay(1);  // yield to other Core 0 tasks (WiFi, BT, etc.)
    }
}

// ---------------------------------------------------------------------------
// twaiInit() — (re-)install and start the TWAI driver with project timing.
//
// Returns true on success.  Called from setup() for the initial bring-up and
// from the error-passive recovery path when the controller is stuck with
// TEC ≥ 128 but never reaches bus-off.
// ---------------------------------------------------------------------------
static bool twaiInit() {
    twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(
        static_cast<gpio_num_t>(CAN_TX_PIN),
        static_cast<gpio_num_t>(CAN_RX_PIN),
        TWAI_MODE_NORMAL);
    g_config.rx_queue_len = 5;
    g_config.tx_queue_len = 5;

    /* Start from the standard 500 kbps macro so that clk_src (and
     * quanta_resolution_hz on ESP-IDF ≥ 5.x) are initialised to the
     * correct platform defaults.  The previous memset(&t_config,0,...)
     * zeroed clk_src, which is NOT TWAI_CLK_SRC_DEFAULT on ESP-IDF 5.x
     * — causing twai_driver_install() to fail or to select the wrong
     * clock, producing a baud-rate mismatch with the STM32 FDCAN.
     *
     * We then override brp/tseg/sjw to achieve an 87.5 % sample point
     * (CiA 301 recommended) that closely matches the STM32's 88.2 %. */
    twai_timing_config_t t_config = TWAI_TIMING_CONFIG_500KBITS();

    /* CRITICAL FIX: On ESP-IDF ≥ 5.0, TWAI_TIMING_CONFIG_500KBITS()
     * sets quanta_resolution_hz = 10 000 000 (10 MHz) with brp = 0.
     * When quanta_resolution_hz > 0, twai_driver_install() calculates:
     *   brp = APB_CLK / quanta_resolution_hz = 80 MHz / 10 MHz = 8
     * This produces:
     *   bit time = (1+13+2) × 8/80 MHz = 1600 ns → 625 kbps
     *
     * The STM32 FDCAN is configured for 500 kbps (170 MHz / 10 / 34).
     * A 25 % baud-rate mismatch makes communication IMPOSSIBLE — every
     * frame fails bit-level validation (stuff/CRC errors, no ACKs).
     *
     * Fix: clear quanta_resolution_hz so the driver uses the manually
     * specified brp = 10 directly:
     *   bit time = (1+13+2) × 10/80 MHz = 2000 ns → 500 kbps  ✓
     *
     * The clk_src field (set by the macro) is preserved, ensuring the
     * correct APB clock source is selected on all ESP-IDF versions.   */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    t_config.quanta_resolution_hz = 0;
#endif
    t_config.brp            = 10;
    t_config.tseg_1         = 13;
    t_config.tseg_2         = 2;
    t_config.sjw            = 2;
    t_config.triple_sampling = false;

