florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    if (twai_driver_install(&g_config, &t_config, &f_config) != ESP_OK) {
        return false;
    }
    if (twai_start() != ESP_OK) {
        twai_driver_uninstall();
        return false;
    }
    return true;
}

// ---------------------------------------------------------------------------
// setup() — called once at power-on
// ---------------------------------------------------------------------------
void setup() {
    Serial.setTxBufferSize(512);   // Prevent Serial.printf() blocking on long diagnostics
    Serial.begin(115200);
    delay(500);
    psram_diagnostic();

    // Reset cause reporting
    esp_reset_reason_t reason = esp_reset_reason();
    Serial.printf("[BOOT][INFO] Reset reason: %s\n",
        reason == ESP_RST_POWERON  ? "PowerOn" :
        reason == ESP_RST_SW       ? "Software" :
        reason == ESP_RST_PANIC    ? "Panic" :
        reason == ESP_RST_INT_WDT  ? "Watchdog(INT)" :
        reason == ESP_RST_TASK_WDT ? "Watchdog(TASK)" :
        reason == ESP_RST_WDT      ? "Watchdog(OTHER)" :
        reason == ESP_RST_BROWNOUT ? "Brownout" :
        reason == ESP_RST_SDIO     ? "SDIO" :
        reason == ESP_RST_DEEPSLEEP ? "DeepSleep" :
                                      "Unknown");

    Serial.println("[BOOT][INFO] ESP32 HMI CAN bring-up booted");

    // Initialize NVS config store
    config_store::init();

    // Initialize persistent touch-calibration NVS namespace.  Must be done
    // BEFORE tft.setTouch() so the loaded calibration (if valid) takes
    // precedence over the compile-time TOUCH_CALIBRATION fallback.
    touch_calibration::init();

    // Initialize PSRAM
    if (psramInit()) {
        // Give system a moment to complete PSRAM initialization
        delay(10);
        Serial.printf("[BOOT][INFO] PSRAM initialized — total: %u bytes, free: %u bytes\n",
                      (unsigned)ESP.getPsramSize(), (unsigned)ESP.getFreePsram());
    } else {
        Serial.println("[BOOT][ERR] PSRAM initialization FAILED — check board_build.arduino.memory_type");
        // Consider halting or entering degraded mode if PSRAM is required
        // while(1) { delay(1000); }
    }

    // Initialize TFT display
    tft.init();
    tft.setRotation(1);  // Landscape mode (480×320)

    // Initialize TFT backlight PWM and apply persisted brightness (clamped to
    // a safe visible range so the screen never appears off after reboot).
    {
        const auto& cfg = config_store::get();
        const uint8_t applied = display_backlight::apply(cfg.brightness);
        if (applied != cfg.brightness) {
            config_store::setBrightness(applied);
            config_store::flush();
        }
    }

    // Apply touch calibration (XPT2046).
    // Order of preference:
    //   1. Persistent calibration from NVS (touch_calibration namespace)
    //      — set by the wizard on first boot or recalibration.
    //   2. Compile-time TOUCH_CALIBRATION from User_Setup.h — used as the
    //      safe fallback so the display ALWAYS boots with a working touch
    //      mapping (the wizard itself relies on this fallback while
    //      capturing new corners on the very first boot).
    {
        uint16_t calData[5] = TOUCH_CALIBRATION;
        if (touch_calibration::loadValid(calData)) {
            Serial.println("[BOOT][INFO] Touch calibration: NVS (persistent)");
        } else {
            Serial.println("[BOOT][INFO] Touch calibration: User_Setup.h fallback");
        }
        tft.setTouch(calData);
    }

    tft.fillScreen(0x2104);  // Dark gray background
    tft.setTextColor(0xFFFF, 0x2104);
    tft.setTextSize(1);
    Serial.println("[BOOT][INFO] Display initialized (480x320 landscape)");

    /* ---- TWAI initialization with CiA 301 optimal timing ----
     *
     * The ESP32-TWAI-CAN library default 500 kbps timing uses a sample
     * point of 80.0 % (BRP=8, TSEG1=15, TSEG2=4).  The STM32 FDCAN is
     * configured at 88.2 %.  The 8.2 % difference is right at the limit
     * of what SJW can compensate — combined with the STM32's HSI ±1 %
     * clock tolerance, this causes persistent BERR / ACK errors.
     *
     * Fix: use custom timing with 87.5 % sample point (CiA 301
     * recommended for 500 kbps), closely matching the STM32's 88.2 %.
     *
     * APB clock  = 80 MHz
     * BRP        = 10    → TQ = 10 / 80 MHz = 125 ns
     * Bit time   = 1 (sync) + 13 (seg1) + 2 (seg2) = 16 TQ = 2 µs
     * Baud rate  = 80 MHz / 10 / 16 = 500 kbps
     * Sample pt  = (1 + 13) / 16 = 87.5 %
     * SJW        = 2  → ±12.5 % oscillator tolerance                  */
    if (twaiInit()) {
        Serial.printf("[CAN][INFO] Initialized at 500 kbps (SP=87.5%%, BRP=10, "
                      "TSEG1=13, TSEG2=2, SJW=2)\n");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
        Serial.printf("[CAN][INFO] ESP-IDF %d.%d.%d — quanta_resolution_hz cleared "
                      "to force BRP mode\n",
                      ESP_IDF_VERSION_MAJOR, ESP_IDF_VERSION_MINOR,
                      ESP_IDF_VERSION_PATCH);
#endif
    } else {
        Serial.println("[CAN][ERR] Initialization FAILED");
    }

    // Initialize obstacle sensor driver (TF-Mini Plus on UART1, GPIO 18)
    //   RX = GPIO 18 (sensor TX → ESP32 RX, 3.3V TTL direct connection)
    //   TX = NOT CONNECTED (sensor RX not wired to ESP32 TX)
    //
    // READ-ONLY MODE: The sensor's RX pin is not connected to the ESP32's
    // TX, so no configuration commands can reach the sensor.
    // Config defaults are selected at compile time based on SENSOR_TYPE.
    {
        obstacle_sensor::Config obsCfg;
        obsCfg.txPin = -1;   // TX not connected — read-only
        obstacle_sensor::init(obsCfg);
    }

    // Initialize CAN TX for obstacle distance frame (0x208)
    can_obstacle::init();

    // Initialize WS2812B LED controller (front GPIO 47 + rear GPIO 48)
    led_ctrl::init();

    // Initialize power manager (ignition key on GPIO 40/41)
    power_mgr::init();

    // Initialize DFPlayer audio (UART2 on GPIO 43/44)
    audio::init();

    // Initialize MCP23017 shifter input (I2C on GPIO 8/9)
    shifter::init();

    // Initialize remote control parser (FlySky FS-iA6B iBUS, GPIO 16 RX).
    // Enabled by default (REMOTE_CONTROL_ENABLED=1 in platformio.ini);
    // compiles to an inline no-op when the flag is set to 0.  See
    // docs/REMOTE_CONTROL_IMPLEMENTATION_PLAN.md Phase 2.
    remote_control::init();

    // Initialize traction switch (DPDT rocker on GPIO 15)
    traction_sw::init();

