florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    }

    // ---- Remote lights (CH8) ----
    // In REMOTE authority mode, CH8 owns both front/rear light relays.
    if (remoteAuthorityActive) {
        bool lightsOn = remote_control::isLightsOn();
        if (frontLedLocalState != lightsOn || rearLedLocalState != lightsOn) {
            frontLedLocalState = lightsOn;
            rearLedLocalState  = lightsOn;
            sendLedCommand(frontLedLocalState, rearLedLocalState);
            config_store::setFrontLedEnabled(frontLedLocalState);
            config_store::setRearLedEnabled(rearLedLocalState);
            audio::play(lightsOn ? audio::Sound::LIGHTS_ON
                                 : audio::Sound::LIGHTS_OFF,
                        audio::Priority::LO);
            Serial.printf("[REMOTE] Lights(CH8) → %s\n", lightsOn ? "ON" : "OFF");
        }
    }

    // ---- Remote audio volume (CH9) ----
    // Debounce + hysteresis to avoid rapid volume chatter from RC jitter.
    if (remoteAuthorityActive) {
        uint8_t remoteVolume = remote_control::getAudioVolume();
        uint8_t delta = (remoteVolume > lastAppliedAudioVolume)
                      ? (remoteVolume - lastAppliedAudioVolume)
                      : (lastAppliedAudioVolume - remoteVolume);
        if (delta >= REMOTE_VOLUME_HYSTERESIS &&
            (now - lastRemoteVolumeSetMs) >= REMOTE_VOLUME_DEBOUNCE_MS) {
            audio::setVolume(remoteVolume);
            config_store::setAudioVolume(remoteVolume);
            lastAppliedAudioVolume = remoteVolume;
            lastRemoteVolumeSetMs  = now;
            Serial.printf("[REMOTE] Volume(CH9) → %u\n", remoteVolume);
        }
    }

    // ---- Power management ----
    power_mgr::update();

    // Welcome audio on startup — with brownout/reboot cooldown
    if (power_mgr::isRunning() && !welcomePlayed) {
        if (lastWelcomePlayMs == 0 ||
            (now - lastWelcomePlayMs) >= WELCOME_COOLDOWN_MS) {
            audio::play(audio::Sound::WELCOME, audio::Priority::HI);
            lastWelcomePlayMs = now;
        }
        welcomePlayed  = true;
        farewellPlayed = false;
    }

    // Farewell audio on shutdown
    if (power_mgr::getState() == power_mgr::PowerState::SHUTTING_DOWN &&
        !farewellPlayed) {
        // Pre-power-cut safe-state handshake: tell the STM32 to enter a
        // commanded safe state (PWM=0, EN=LOW, relays OFF) BEFORE the
        // external delay relay physically removes power.  The 100 ms
        // pause gives the STM32 a deterministic window to react before
        // we continue with the existing shutdown sequence.  This does
        // NOT alter SHUTDOWN_DELAY_MS, GPIO 41, or the LED-OFF below;
        // if the frame is lost on the bus, behaviour is unchanged.
        sendSystemShutdown();
        delay(100);

        config_store::flush();  // Persist any unsaved changes before shutdown
        audio::play(audio::Sound::FAREWELL, audio::Priority::HI);
        farewellPlayed = true;
        welcomePlayed  = false;
        // Turn off LEDs during shutdown
        if (frontLedLocalState || rearLedLocalState) {
            frontLedLocalState = false;
            rearLedLocalState  = false;
            sendLedCommand(false, false);
        }
    }

    // ---- CAN-triggered audio events ----
    // Multi-error burst arbitration: when multiple errors fire within the
    // burst window, play the highest-severity sound (dominant fault) instead
    // of collapsing to ERROR_GENERAL.  (Phase 1 AUDIO_MITIGATION_PLAN)
    {
        auto st = static_cast<uint8_t>(vehicleData.heartbeat().systemState);

        // --- Helper lambda: queue an error/warning sound with burst arbitration ---
        auto playWarning = [&](audio::Sound sound, audio::Priority pri) {
            // Track burst window
            if (errorBurstCount == 0) {
                errorBurstStartMs = now;
                burstDominantSound = sound;
                burstDominantPri   = pri;
            }
            ++errorBurstCount;

            // Track highest-severity sound in burst
            if (burstSeverity(sound) > burstSeverity(burstDominantSound)) {
                burstDominantSound = sound;
                burstDominantPri   = pri;
            }

            if ((now - errorBurstStartMs) < ERROR_BURST_WINDOW_MS &&
                errorBurstCount >= ERROR_BURST_THRESHOLD) {
                // Multiple errors in short window → play dominant fault
                audio::play(burstDominantSound, burstDominantPri);
            } else {
                audio::play(sound, pri);
            }
        };

        // Reset burst counter when window expires
        if (errorBurstCount > 0 &&
            (now - errorBurstStartMs) >= ERROR_BURST_WINDOW_MS) {
            errorBurstCount = 0;
        }

        // --- System state transitions ---
        if (st != lastAudioSystemState) {
            // Emergency / safe state
            if (st == static_cast<uint8_t>(can::SystemState::SAFE) ||
                st == static_cast<uint8_t>(can::SystemState::ERROR)) {
                playWarning(audio::Sound::EMERGENCY, audio::Priority::HI);
            }
            // Degraded / limp-home
            else if (st == static_cast<uint8_t>(can::SystemState::DEGRADED) ||
                     st == static_cast<uint8_t>(can::SystemState::LIMP_HOME)) {
                playWarning(audio::Sound::ERROR_GENERAL, audio::Priority::HI);
            }
            // Recovery to ACTIVE from error state
            else if (st == static_cast<uint8_t>(can::SystemState::ACTIVE) &&
                     (lastAudioSystemState == static_cast<uint8_t>(can::SystemState::SAFE) ||
                      lastAudioSystemState == static_cast<uint8_t>(can::SystemState::ERROR))) {
                audio::play(audio::Sound::SAFETY_RESET, audio::Priority::MEDIUM);
            }
            lastAudioSystemState = st;
        }

        // --- Battery warnings (with separate low and critical thresholds) ---
        uint16_t battVoltRaw = vehicleData.battery().voltageRaw;
        if (battVoltRaw > 0 && battVoltRaw < BATTERY_CRIT_THRESHOLD_RAW) {
            if (!batteryCritPlayed) {
                playWarning(audio::Sound::BATTERY_CRITICAL, audio::Priority::HI);
                batteryCritPlayed = true;
                batteryLowPlayed  = true;  // skip low if critical already played
            }
        } else if (battVoltRaw > 0 && battVoltRaw < BATTERY_LOW_THRESHOLD_RAW) {
            if (!batteryLowPlayed) {
                playWarning(audio::Sound::BATTERY_LOW, audio::Priority::MEDIUM);
                batteryLowPlayed = true;
            }
        } else {
            batteryLowPlayed  = false;  // reset when voltage recovers
            batteryCritPlayed = false;
        }

        // --- Temperature warnings ---
        {
            int8_t maxTemp = INT8_MIN;
            for (uint8_t i = 0; i < vehicle::NUM_TEMP_SENSORS; ++i) {
                int8_t t = vehicleData.temp().temps[i];
                if (t > maxTemp) maxTemp = t;
            }
            if (maxTemp > TEMP_HIGH_THRESHOLD) {
                if (!tempHighPlayed) {
                    playWarning(audio::Sound::TEMP_HIGH, audio::Priority::MEDIUM);
                    tempHighPlayed = true;
                }
            } else if (tempHighPlayed && maxTemp < (TEMP_HIGH_THRESHOLD - TEMP_HIGH_HYSTERESIS)) {
                audio::play(audio::Sound::TEMP_NORMAL, audio::Priority::LO);
                tempHighPlayed = false;
            }
        }

        // --- ABS / TCS activation announcements ---
        {
            uint8_t absNow = vehicleData.safety().absActive;
            uint8_t tcsNow = vehicleData.safety().tcsActive;
            if (absNow != lastAbsActive) {
                audio::play(absNow ? audio::Sound::ABS_ON : audio::Sound::ABS_OFF,
                            audio::Priority::LO);
                lastAbsActive = absNow;
            }
            if (tcsNow != lastTcsActive) {
                audio::play(tcsNow ? audio::Sound::TCS_ON : audio::Sound::TCS_OFF,
                            audio::Priority::LO);
                lastTcsActive = tcsNow;
            }
        }

        // --- Overcurrent / sensor fault from safety error code ---
        {
            uint8_t safeErr = vehicleData.safety().errorCode;
            if (safeErr != lastSafetyError && safeErr != 0) {
                auto se = static_cast<can::SafetyError>(safeErr);
                switch (se) {
                    case can::SafetyError::OVERCURRENT:
                        playWarning(audio::Sound::OVERCURRENT, audio::Priority::HI);
                        break;
                    case can::SafetyError::OVERTEMP:
                        playWarning(audio::Sound::SENSOR_TEMP_ERROR, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::SENSOR_FAULT:
                        playWarning(audio::Sound::SENSOR_SPEED_ERROR, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::CENTERING:
                        playWarning(audio::Sound::ENCODER_ERROR, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::I2C_FAILURE:
                        playWarning(audio::Sound::SENSOR_CURRENT_ERROR, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::OBSTACLE:
                        playWarning(audio::Sound::OBSTACLE_WARN, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::BATTERY_OV_WARN:
                        // No dedicated overvoltage sound exists; BATTERY_LOW is the
                        // closest available warning tone.  A future audio track can be
                        // added and this mapping updated without any logic change.
                        playWarning(audio::Sound::BATTERY_LOW, audio::Priority::MEDIUM);
                        break;
                    case can::SafetyError::BATTERY_OV_CRIT:
                        playWarning(audio::Sound::BATTERY_CRITICAL, audio::Priority::HI);
                        break;
                    case can::SafetyError::RELAY_OPEN:
                        playWarning(audio::Sound::ERROR_GENERAL, audio::Priority::HI);
                        break;
                    default:
                        break;
                }

                // ---- DTC Fault Log: persist error event to NVS ----
                {
                    config_store::FaultLogEntry fte;
                    fte.uptimeMs    = now;
                    fte.errorCode   = safeErr;
                    fte.faultFlags  = vehicleData.heartbeat().faultFlags;
                    fte.subsystem   = vehicleData.diag().subsystem;
                    fte.systemState = static_cast<uint8_t>(vehicleData.heartbeat().systemState);
                    config_store::logFault(fte);
                }

                lastSafetyError = safeErr;
            } else if (safeErr == 0) {
                lastSafetyError = 0;
            }
        }

        // --- Lights status from STM32 CAN echo ---
        {
            bool frontNow = vehicleData.lights().frontRelayOn;
            bool rearNow  = vehicleData.lights().rearRelayOn;
            if (lightsAudioInit) {
                if (frontNow != lastFrontRelayOn || rearNow != lastRearRelayOn) {
                    bool anyOn = frontNow || rearNow;
                    audio::play(anyOn ? audio::Sound::LIGHTS_ON
                                      : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                }
            }
            lastFrontRelayOn = frontNow;
            lastRearRelayOn  = rearNow;
            lightsAudioInit  = true;
        }

        // --- Obstacle proximity warning — beep when zone ≥ 3 (critical/emergency) ---
        obstacle_sensor::Reading obsRd = obstacle_sensor::getReading();
        if (obsRd.healthy && obsRd.zone >= 3 &&
            (now - lastObstacleWarnMs) >= OBSTACLE_WARN_INTERVAL_MS) {
            audio::play(audio::Sound::OBSTACLE_WARN, audio::Priority::MEDIUM);
            lastObstacleWarnMs = now;
        }
    }

    // ---- Audio update ----
    audio::update();

    // ---- Periodic NVS flush (mitigate write wear) ----
    if ((now - lastNvsFlushMs) >= NVS_FLUSH_INTERVAL_MS) {
        lastNvsFlushMs = now;
        config_store::flush();
    }

    // ---- Runtime counter for maintenance tracking (§2.1, §2.2) ----
    // Accumulate milliseconds in RAM continuously while operating.
    // Commit full seconds to NVS periodically (every ~60 s) to reduce flash wear.
    // Delta-based: uses real elapsed time, not frame count.
    {
        auto sysState = vehicleData.heartbeat().systemState;
        bool isOperating = (sysState == can::SystemState::ACTIVE ||
                            sysState == can::SystemState::DEGRADED ||
                            sysState == can::SystemState::LIMP_HOME);
        if (isOperating) {
            // Accumulate real elapsed ms since last tick (§2.1 — delta-based)
            // Unsigned subtraction handles millis() wrap correctly (~49.7 days).
            // Clamp to a reasonable max to guard against stale lastRuntimeTickMs.
            uint32_t elapsed = static_cast<uint32_t>(now - lastRuntimeTickMs);
            if (elapsed > 10000) elapsed = 10000;  // sanity: cap at 10 s per tick
            runtimeAccumMs += elapsed;

            // Commit accumulated whole seconds to NVS periodically (§2.2)
            if (runtimeAccumMs >= RUNTIME_COMMIT_INTERVAL_MS) {
                uint32_t wholeSec = runtimeAccumMs / 1000;
                runtimeAccumMs -= wholeSec * 1000;  // keep fractional ms
                uint32_t cur = config_store::get().runtimeSeconds;
                config_store::setRuntimeSeconds(cur + wholeSec);
            }
        } else {
            // Not operating: commit any accumulated partial seconds before discarding
            if (runtimeAccumMs >= 1000) {
                uint32_t wholeSec = runtimeAccumMs / 1000;
                uint32_t cur = config_store::get().runtimeSeconds;
                config_store::setRuntimeSeconds(cur + wholeSec);
            }
            runtimeAccumMs = 0;
        }
        lastRuntimeTickMs = now;

        // Play maintenance reminder once per power cycle when threshold crossed (§2.3)
        if (config_store::isMaintenanceDue() && !maintenanceWarnPlayed &&
            !config_store::get().maintAcknowledged) {
            audio::play(audio::Sound::TEST_SYSTEM, audio::Priority::LO);
            maintenanceWarnPlayed = true;
            Serial.println("[MAINT] Maintenance reminder — service due");
        }
    }

