florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
            int16_t angle = vehicleData.steering().angleRaw;
            static led_ctrl::TurnSignal prevTurn = led_ctrl::TurnSignal::OFF;
            static led_ctrl::TurnSignal candidateTurn = led_ctrl::TurnSignal::OFF;
            static unsigned long candidateStartMs = 0;

            if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
                // Hazard override — immediate, no time filter
                led_ctrl::setTurnSignal(led_ctrl::TurnSignal::HAZARD);
                // Don't persist HAZARD into prevTurn — reset to OFF so that
                // when the system recovers, the hysteresis starts clean.
                prevTurn = led_ctrl::TurnSignal::OFF;
                candidateTurn = led_ctrl::TurnSignal::OFF;
                candidateStartMs = 0;
            } else {
                // Compute desired turn from angle + hysteresis
                led_ctrl::TurnSignal desired = prevTurn;
                if (angle < -TURN_ON_RAW) {
                    desired = led_ctrl::TurnSignal::LEFT;
                } else if (angle > TURN_ON_RAW) {
                    desired = led_ctrl::TurnSignal::RIGHT;
                } else if (angle > -TURN_OFF_RAW && angle < TURN_OFF_RAW) {
                    desired = led_ctrl::TurnSignal::OFF;
                }
                // Between OFF_RAW and ON_RAW: keep previous state (hysteresis band)

                // Time filter: require new state to persist ≥100 ms
                if (desired != prevTurn) {
                    if (desired != candidateTurn) {
                        candidateTurn = desired;
                        candidateStartMs = now;
                    } else if ((now - candidateStartMs) >= TURN_PERSIST_MS) {
                        prevTurn = desired;
                        candidateStartMs = 0;
                    }
                } else {
                    // Stable — reset candidate
                    candidateTurn = prevTurn;
                    candidateStartMs = 0;
                }

                led_ctrl::setTurnSignal(prevTurn);
            }
        }

        // Single update call drives all animation + FastLED.show()
        led_ctrl::update();
    }

    // Send heartbeat 0x011 every 100 ms
    if (now - lastHeartbeatMs >= can::HEARTBEAT_INTERVAL_MS) {
        lastHeartbeatMs = now;

        CanFrame frame = {};
        frame.identifier       = can::HEARTBEAT_ESP32;
        frame.extd             = 0;
        frame.data_length_code = 1;
        frame.data[0]          = heartbeatCounter++;

        ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    }

#if REMOTE_CONTROL_ENABLED
    // ------------------------------------------------------------------
    // Remote control → CAN bridge — Modo Control Remoto Clásico
    //
    // The ESP32 NEVER writes to 0x100/0x101 on behalf of the RC: those
    // IDs remain reserved for the local pedal/steering pipeline.
    //
    // Instead, every 50 ms the ESP32 emits CMD_RC_OVERRIDE (0x10A) with
    // raw stick values and a flag indicating whether the operator wants
    // RC to take control (CH10 == REMOTE && parser ACTIVE && CH5 not
    // killed).  The STM32 arbiter (rc_arbiter.c) decides which source
    // feeds Safety_ValidateThrottle / Safety_ValidateSteering using a
    // strict 200 ms watchdog.  Failsafe is automatic: if we stop sending
    // 0x10A (RC off, RF lost, ESP32 dead), the STM32 reverts to local
    // pedal control within 200 ms with no further action.
    // ------------------------------------------------------------------
    static uint32_t lastRcCmdMs = 0;
    static uint8_t  rcOverrideSeq = 0;
    if ((now - lastRcCmdMs) >= can::CMD_THROTTLE_RATE_MS) {
        lastRcCmdMs = now;

        // Override-active gate combines: parser fresh (≤150 ms),
        // CH5 kill switch released, CH10 selector in REMOTE, and STM32
        // alive.  Anything failing here → override_flag=0 → STM32
        // returns control to the pedal at the next arbiter check.
        bool overrideActive = remoteMotionAuthorityActive;

        // Sanitize stick values regardless of override gate so the
        // STM32 always sees in-range numbers (avoids spurious arbiter
        // rejections when override_flag=0).
        float thrPct = remote_control::getThrottlePct();
        if (thrPct < 0.0f)   thrPct = 0.0f;
        if (thrPct > 100.0f) thrPct = 100.0f;

        float strDeg = remote_control::getSteeringDeg();
        if (strDeg < -30.0f) strDeg = -30.0f;
        if (strDeg >  30.0f) strDeg =  30.0f;
        int16_t deg10 = static_cast<int16_t>(strDeg * 10.0f);

        CanFrame frRc = {};
        frRc.identifier       = can::CMD_RC_OVERRIDE;
        frRc.extd             = 0;
        frRc.data_length_code = 5;
        frRc.data[0]          = overrideActive ? 0x01 : 0x00;
        frRc.data[1]          = static_cast<uint8_t>(thrPct + 0.5f);
        frRc.data[2]          = static_cast<uint8_t>(deg10 & 0xFF);
        frRc.data[3]          = static_cast<uint8_t>((deg10 >> 8) & 0xFF);
        frRc.data[4]          = rcOverrideSeq++;
        ESP32Can.writeFrame(frRc, 0);
    }
#endif // REMOTE_CONTROL_ENABLED

    // Serial heartbeat every ~1 second
    if (now - lastSerialMs >= 1000) {
        lastSerialMs = now;
        Serial.println("[HMI] heartbeat");
    }

    // TWAI bus diagnostic — log error counters every 5 seconds
    if (now - lastCanDiagMs >= 5000) {
        lastCanDiagMs = now;
        twai_status_info_t status;
        if (twai_get_status_info(&status) == ESP_OK) {
            const char* stateStr = "UNKNOWN";
            switch (status.state) {
                case TWAI_STATE_STOPPED:    stateStr = "STOPPED";    break;
                case TWAI_STATE_RUNNING:    stateStr = "RUNNING";    break;
                case TWAI_STATE_BUS_OFF:    stateStr = "BUS_OFF";    break;
                case TWAI_STATE_RECOVERING: stateStr = "RECOVERING"; break;
            }
            Serial.printf("[CAN][DIAG] state=%s tx_err=%lu rx_err=%lu "
                          "tx_fail=%lu rx_miss=%lu arb_lost=%lu bus_err=%lu\n",
                          stateStr,
                          (unsigned long)status.tx_error_counter,
                          (unsigned long)status.rx_error_counter,
                          (unsigned long)status.tx_failed_count,
                          (unsigned long)status.rx_missed_count,
                          (unsigned long)status.arb_lost_count,
                          (unsigned long)status.bus_error_count);
            if (status.tx_error_counter >= 128 &&
                status.state == TWAI_STATE_RUNNING) {
                Serial.println("[CAN][WARN] Error-passive "
                               "(tx_err>=128). Check CAN bus wiring "
                               "and termination.");
            }
        }
    }

